export enum FilmType {
  Film = 'FILM',
  TV_SHOW = 'TV_SHOW',
  TV_SERIES = 'TV_SERIES',
  MINI_SERIAL = 'MINI_SERIAL',
  ALL = 'ALL',
}

export enum FilmOrder {
  YEAR = 'YEAR',
  RATING = 'RATING',
  NUM_VOTE = 'NUM_VOTE',
}

export enum FilmTOP {
  TOP_250_BEST_FILMS = 'TOP_250_BEST_FILMS',
  TOP_100_POPULAR_FILMS = 'TOP_100_POPULAR_FILMS',
  TOP_AWAIT_FILMS = 'TOP_AWAIT_FILMS',
}

// const genres: [
//   {
//     id: 1;
//     genre: 'триллер';
//   },
//   {
//     id: 2;
//     genre: 'драма';
//   },
//   {
//     id: 3;
//     genre: 'криминал';
//   },
//   {
//     id: 4;
//     genre: 'мелодрама';
//   },
//   {
//     id: 5;
//     genre: 'детектив';
//   },
//   {
//     id: 6;
//     genre: 'фантастика';
//   },
//   {
//     id: 7;
//     genre: 'приключения';
//   },
//   {
//     id: 8;
//     genre: 'биография';
//   },
//   {
//     id: 9;
//     genre: 'фильм-нуар';
//   },
//   {
//     id: 10;
//     genre: 'вестерн';
//   },
//   {
//     id: 11;
//     genre: 'боевик';
//   },
//   {
//     id: 12;
//     genre: 'фэнтези';
//   },
//   {
//     id: 13;
//     genre: 'комедия';
//   },
//   {
//     id: 14;
//     genre: 'военный';
//   },
//   {
//     id: 15;
//     genre: 'история';
//   },
//   {
//     id: 16;
//     genre: 'музыка';
//   },
//   {
//     id: 17;
//     genre: 'ужасы';
//   },
//   {
//     id: 18;
//     genre: 'мультфильм';
//   },
//   {
//     id: 19;
//     genre: 'семейный';
//   },
//   {
//     id: 20;
//     genre: 'мюзикл';
//   },
//   {
//     id: 21;
//     genre: 'спорт';
//   },
//   {
//     id: 22;
//     genre: 'документальный';
//   },
//   {
//     id: 23;
//     genre: 'короткометражка';
//   },
//   {
//     id: 24;
//     genre: 'аниме';
//   },
//   {
//     id: 25;
//     genre: '';
//   },
//   {
//     id: 26;
//     genre: 'новости';
//   },
//   {
//     id: 27;
//     genre: 'концерт';
//   },
//   {
//     id: 28;
//     genre: 'для взрослых';
//   },
//   {
//     id: 29;
//     genre: 'церемония';
//   },
//   {
//     id: 30;
//     genre: 'реальное ТВ';
//   },
//   {
//     id: 31;
//     genre: 'игра';
//   },
//   {
//     id: 32;
//     genre: 'ток-шоу';
//   },
//   {
//     id: 33;
//     genre: 'детский';
//   },
// ];

export const countries = [
  {
    id: 1,
    value: 'США',
  },
  {
    id: 2,
    value: 'Швейцария',
  },
  {
    id: 3,
    value: 'Франция',
  },
  {
    id: 4,
    value: 'Польша',
  },
  {
    id: 5,
    value: 'Великобритания',
  },
  {
    id: 6,
    value: 'Швеция',
  },
  {
    id: 7,
    value: 'Индия',
  },
  {
    id: 8,
    value: 'Испания',
  },
  {
    id: 9,
    value: 'Германия',
  },
  {
    id: 10,
    value: 'Италия',
  },
  {
    id: 11,
    value: 'Гонконг',
  },

  {
    id: 13,
    value: 'Австралия',
  },
  {
    id: 14,
    value: 'Канада',
  },
  {
    id: 15,
    value: 'Мексика',
  },
  {
    id: 16,
    value: 'Япония',
  },
  {
    id: 17,
    value: 'Дания',
  },
  {
    id: 18,
    value: 'Чехия',
  },
  {
    id: 19,
    value: 'Ирландия',
  },
  {
    id: 20,
    value: 'Люксембург',
  },
  {
    id: 21,
    value: 'Китай',
  },
  {
    id: 22,
    value: 'Норвегия',
  },
  {
    id: 23,
    value: 'Нидерланды',
  },
  {
    id: 24,
    value: 'Аргентина',
  },
  {
    id: 25,
    value: 'Финляндия',
  },
  {
    id: 26,
    value: 'Босния и Герцеговина',
  },
  {
    id: 27,
    value: 'Австрия',
  },
  {
    id: 28,
    value: 'Тайвань',
  },
  {
    id: 29,
    value: 'Новая Зеландия',
  },
  {
    id: 30,
    value: 'Бразилия',
  },
  {
    id: 31,
    value: 'Чехословакия',
  },
  {
    id: 32,
    value: 'Мальта',
  },
  {
    id: 33,
    value: 'СССР',
  },
  {
    id: 34,
    value: 'Россия',
  },
  {
    id: 35,
    value: 'Югославия',
  },
  {
    id: 36,
    value: 'Португалия',
  },
  {
    id: 37,
    value: 'Румыния',
  },
  {
    id: 38,
    value: 'Хорватия',
  },
  {
    id: 39,
    value: 'ЮАР',
  },
  {
    id: 40,
    value: 'Куба',
  },
  {
    id: 41,
    value: 'Колумбия',
  },
  {
    id: 42,
    value: 'Израиль',
  },
  {
    id: 43,
    value: 'Намибия',
  },
  {
    id: 44,
    value: 'Турция',
  },
  {
    id: 45,
    value: 'Бельгия',
  },
  {
    id: 46,
    value: 'Сальвадор',
  },
  {
    id: 47,
    value: 'Исландия',
  },
  {
    id: 48,
    value: 'Венгрия',
  },
  {
    id: 49,
    value: 'Корея Южная',
  },
  {
    id: 50,
    value: 'Лихтенштейн',
  },
  {
    id: 51,
    value: 'Болгария',
  },
  {
    id: 52,
    value: 'Филиппины',
  },
  {
    id: 53,
    value: 'Доминикана',
  },

  {
    id: 55,
    value: 'Марокко',
  },
  {
    id: 56,
    value: 'Таиланд',
  },
  {
    id: 57,
    value: 'Кения',
  },
  {
    id: 58,
    value: 'Пакистан',
  },
  {
    id: 59,
    value: 'Иран',
  },
  {
    id: 60,
    value: 'Панама',
  },
  {
    id: 61,
    value: 'Аруба',
  },
  {
    id: 62,
    value: 'Ямайка',
  },
  {
    id: 63,
    value: 'Греция',
  },
  {
    id: 64,
    value: 'Тунис',
  },
  {
    id: 65,
    value: 'Кыргызстан',
  },
  {
    id: 66,
    value: 'Пуэрто Рико',
  },
  {
    id: 67,
    value: 'Казахстан',
  },
  {
    id: 71,
    value: 'Сингапур',
  },
  {
    id: 72,
    value: 'Словакия',
  },
  {
    id: 73,
    value: 'Афганистан',
  },
  {
    id: 74,
    value: 'Индонезия',
  },
  {
    id: 75,
    value: 'Перу',
  },
  {
    id: 76,
    value: 'Бермуды',
  },
  {
    id: 77,
    value: 'Монако',
  },
  {
    id: 78,
    value: 'Зимбабве',
  },
  {
    id: 79,
    value: 'Вьетнам',
  },
  {
    id: 81,
    value: 'Саудовская Аравия',
  },
  {
    id: 82,
    value: 'Танзания',
  },
  {
    id: 83,
    value: 'Ливия',
  },
  {
    id: 84,
    value: 'Ливан',
  },
  {
    id: 85,
    value: 'Кувейт',
  },
  {
    id: 86,
    value: 'Египет',
  },
  {
    id: 87,
    value: 'Литва',
  },
  {
    id: 88,
    value: 'Венесуэла',
  },
  {
    id: 89,
    value: 'Словения',
  },
  {
    id: 90,
    value: 'Чили',
  },
  {
    id: 91,
    value: 'Багамы',
  },
  {
    id: 92,
    value: 'Эквадор',
  },
  {
    id: 93,
    value: 'Коста-Рика',
  },
  {
    id: 94,
    value: 'Кипр',
  },
  {
    id: 95,
    value: 'Уругвай',
  },
  {
    id: 96,
    value: 'Ирак',
  },
  {
    id: 97,
    value: 'Мартиника',
  },
  {
    id: 98,
    value: 'Эстония',
  },
  {
    id: 99,
    value: 'ОАЭ',
  },
  {
    id: 100,
    value: 'Бангладеш',
  },
  {
    id: 101,
    value: 'Македония',
  },
  {
    id: 102,
    value: 'Гвинея',
  },
  {
    id: 103,
    value: 'Иордания',
  },
  {
    id: 104,
    value: 'Латвия',
  },
  {
    id: 105,
    value: 'Армения',
  },
  {
    id: 106,
    value: 'Украина',
  },
  {
    id: 107,
    value: 'Сирия',
  },
  {
    id: 108,
    value: 'Шри-Ланка',
  },
  {
    id: 109,
    value: 'Нигерия',
  },
  {
    id: 110,
    value: 'Берег Слоновой кости',
  },
  {
    id: 111,
    value: 'Грузия',
  },
  {
    id: 112,
    value: 'Сенегал',
  },
  {
    id: 113,
    value: 'Монголия',
  },
  {
    id: 114,
    value: 'Габон',
  },
  {
    id: 115,
    value: 'Замбия',
  },
  {
    id: 116,
    value: 'Албания',
  },
  {
    id: 117,
    value: 'Камерун',
  },
  {
    id: 118,
    value: 'Буркина-Фасо',
  },
  {
    id: 119,
    value: 'Узбекистан',
  },
  {
    id: 120,
    value: 'Малайзия',
  },
  {
    id: 121,
    value: 'Сербия',
  },
  {
    id: 122,
    value: 'Гана',
  },
  {
    id: 123,
    value: 'Таджикистан',
  },
  {
    id: 124,
    value: 'Гаити',
  },
  {
    id: 125,
    value: 'Конго (ДРК)',
  },
  {
    id: 126,
    value: 'Гватемала',
  },
  {
    id: 127,
    value: 'Российская империя',
  },
  {
    id: 128,
    value: 'Беларусь',
  },
  {
    id: 129,
    value: 'Молдова',
  },
  {
    id: 130,
    value: 'Азербайджан',
  },
  {
    id: 131,
    value: 'Палестина',
  },
  {
    id: 132,
    value: 'Оккупированная Палестинская территория',
  },
  {
    id: 133,
    value: 'Корея Северная',
  },
  {
    id: 134,
    value: 'Никарагуа',
  },
  {
    id: 135,
    value: 'Камбоджа',
  },
  {
    id: 136,
    value: 'Ангола',
  },
  {
    id: 137,
    value: 'Сербия и Черногория',
  },
  {
    id: 138,
    value: 'Непал',
  },
  {
    id: 139,
    value: 'Бенин',
  },
  {
    id: 140,
    value: 'Гваделупа',
  },
  {
    id: 141,
    value: 'Гренландия',
  },
  {
    id: 142,
    value: 'Гвинея-Бисау',
  },
  {
    id: 143,
    value: 'Макао',
  },
  {
    id: 144,
    value: 'Парагвай',
  },
  {
    id: 145,
    value: 'Мавритания',
  },
  {
    id: 146,
    value: 'Руанда',
  },
  {
    id: 147,
    value: 'Фарерские острова',
  },
  {
    id: 148,
    value: 'Кот-д’Ивуар',
  },
  {
    id: 149,
    value: 'Гибралтар',
  },
  {
    id: 150,
    value: 'Ботсвана',
  },
  {
    id: 151,
    value: 'Боливия',
  },
  {
    id: 152,
    value: 'Мадагаскар',
  },
  {
    id: 153,
    value: 'Кабо-Верде',
  },
  {
    id: 154,
    value: 'Чад',
  },
  {
    id: 155,
    value: 'Мали',
  },
  {
    id: 156,
    value: 'Фиджи',
  },
  {
    id: 157,
    value: 'Бутан',
  },
  {
    id: 158,
    value: 'Барбадос',
  },
  {
    id: 159,
    value: 'Тринидад и Тобаго',
  },
  {
    id: 160,
    value: 'Мозамбик',
  },
  {
    id: 161,
    value: 'Заир',
  },
  {
    id: 162,
    value: 'Андорра',
  },
  {
    id: 163,
    value: 'Туркменистан',
  },
  {
    id: 164,
    value: 'Гайана',
  },
  {
    id: 165,
    value: 'Корея',
  },
  {
    id: 166,
    value: 'Нигер',
  },
  {
    id: 167,
    value: 'Конго',
  },
  {
    id: 168,
    value: 'Того',
  },
  {
    id: 169,
    value: 'Ватикан',
  },
  {
    id: 170,
    value: 'Черногория',
  },
  {
    id: 171,
    value: 'Бурунди',
  },
  {
    id: 172,
    value: 'Папуа - Новая Гвинея',
  },
  {
    id: 173,
    value: 'Бахрейн',
  },
  {
    id: 174,
    value: 'Гондурас',
  },
  {
    id: 175,
    value: 'Судан',
  },
  {
    id: 176,
    value: 'Эфиопия',
  },
  {
    id: 177,
    value: 'Йемен',
  },
  {
    id: 178,
    value: 'Вьетнам Северный',
  },
  {
    id: 179,
    value: 'Суринам',
  },
  {
    id: 180,
    value: 'Маврикий',
  },
  {
    id: 181,
    value: 'Белиз',
  },
  {
    id: 182,
    value: 'Либерия',
  },
  {
    id: 183,
    value: 'Лесото',
  },
  {
    id: 184,
    value: 'Уганда',
  },
  {
    id: 185,
    value: 'Каймановы острова',
  },
  {
    id: 186,
    value: 'Антигуа и Барбуда',
  },
  {
    id: 187,
    value: 'Западная Сахара',
  },
  {
    id: 188,
    value: 'Сан-Марино',
  },
  {
    id: 189,
    value: 'Гуам',
  },
  {
    id: 190,
    value: 'Косово',
  },
  {
    id: 191,
    value: 'Лаос',
  },
  {
    id: 192,
    value: 'Катар',
  },
  {
    id: 193,
    value: 'Оман',
  },
  {
    id: 194,
    value: 'Американские Виргинские острова',
  },
  {
    id: 195,
    value: 'Сиам',
  },
  {
    id: 196,
    value: 'Сьерра-Леоне',
  },
  {
    id: 197,
    value: 'Эритрея',
  },
  {
    id: 198,
    value: 'Сомали',
  },
  {
    id: 199,
    value: 'Доминика',
  },
  {
    id: 200,
    value: 'Бирма',
  },
  {
    id: 201,
    value: 'Реюньон',
  },
  {
    id: 202,
    value: 'Федеративные Штаты Микронезии',
  },
  {
    id: 203,
    value: 'Самоа',
  },
  {
    id: 204,
    value: 'Американское Самоа',
  },
  {
    id: 205,
    value: 'Свазиленд',
  },
  {
    id: 206,
    value: 'Французская Полинезия',
  },
  {
    id: 207,
    value: 'Мьянма',
  },
  {
    id: 208,
    value: 'Новая Каледония',
  },
  {
    id: 209,
    value: 'Французская Гвиана',
  },
  {
    id: 210,
    value: 'Сент-Винсент и Гренадины',
  },
  {
    id: 211,
    value: 'Малави',
  },
  {
    id: 212,
    value: 'Экваториальная Гвинея',
  },
  {
    id: 213,
    value: 'Коморы',
  },
  {
    id: 214,
    value: 'Кирибати',
  },
  {
    id: 215,
    value: 'Тувалу',
  },
  {
    id: 216,
    value: 'Тимор-Лесте',
  },
  {
    id: 217,
    value: 'ЦАР',
  },
  {
    id: 218,
    value: 'Тонга',
  },
  {
    id: 219,
    value: 'Гренада',
  },
  {
    id: 220,
    value: 'Гамбия',
  },
  {
    id: 221,
    value: 'Антарктида',
  },
  {
    id: 222,
    value: 'Острова Кука',
  },
  {
    id: 223,
    value: 'Остров Мэн',
  },

  {
    id: 229,
    value: 'Палау',
  },
  {
    id: 230,
    value: 'Сент-Люсия',
  },
  {
    id: 231,
    value: 'Вануату',
  },
  {
    id: 232,
    value: 'Мальдивы',
  },
  {
    id: 233,
    value: 'Босния',
  },
  {
    id: 234,
    value: 'Уоллис и Футуна',
  },

  {
    id: 236,
    value: 'Киргизия',
  },
  {
    id: 239,
    value: 'Джибути',
  },
];

export const years = [
  {
    id: '1990-2000',
    value: '1990-2000',
  },
  {
    id: '2000-2005',
    value: '2000-2005',
  },
  {
    id: '2005-2010',
    value: '2005-2010',
  },
  {
    id: '2010-2015',
    value: '2010-2015',
  },
  {
    id: '2015-2022',
    value: '2015-2022',
  },
];

export const FilmGenres = {
  thriller: 1,
  drama: 2,
  cartoon: 18,
};
